package mingaz.lubinskiy.app.department

fun departmentsList(): ArrayList<Department>{
    return arrayListOf(
        Department(
            id = 0,
            name = "Производственно-техническое управление (ПТУ)"
        ),
        Department(
            id = 1,
            name = "Группа менеджмента качества (ГМК)"
        ),
        Department(
            id = 2,
            name = "Техническая инспекция (ТИ)"
        ),
        Department(
            id = 3,
            name = "Отдел режимов газоснабжения и учета газа (ОРГиУГ)"
        ),
        Department(
            id = 4,
            name = "Транспортная служба (ТС)"
        ),
        Department(
            id = 5,
            name = "Служба эксплуатации объектов газораспределительной системы (СЭОГС) "
        ),
        Department(
            id = 6,
            name = "Ремонтно-механический цех (РМЦ)"
        ),
        Department(
            id = 7,
            name = "Служба неразрушающего контроля измерений и технической диагностики (СНКИиТД)  "
        ),
        Department(
            id = 8,
            name = "Служба аварийно-восстановительных работ (САВР)"
        ),
        Department(
            id = 9,
            name = "Служба эксплуатации внутридомовых объектов газопотребления (СЭВОГ)"
        ),
        Department(
            id = 10,
            name = "Служба главного энергетика, метрологического обеспечения и охраны окружающей среды (СГЭМОиООС)"
        ),
        Department(
            id = 11,
            name = "Отдел телеметрии и связи (ОТиС)"
        ),
        Department(
            id = 12,
            name = "Служба эксплуатации установок защиты и комплексного приборного обследования (СЭУЗиКПО)"
        ),
        Department(
            id = 13,
            name = "Служба учёта потреблённого газа населением (СУПГН)"
        ),
        Department(
            id = 14,
            name = "Финансовый отдел (ФО)"
        ),
        Department(
            id = 15,
            name = "Планово-экономический отдел (ПЭО)"
        ),
        Department(
            id = 16,
            name = "Отдел автоматизированных систем управления (ОАСУ)"
        ),
        Department(
            id = 17,
            name = "Филиал “Оздоровительный комплекс “Огонек”"
        ),
        Department(
            id = 18,
            name = "Филиал “Оздоровительный комплекс “Огонек”"
        ),
        Department(
            id = 19,
            name = "Служба строительно-ремонтных работ (ССРР)"
        ),
        Department(
            id = 20,
            name = "Служба заказчика"
        ),
        Department(
            id = 21,
            name = "Отдел развития промышленного и сельскохозяйственного производства (ОРПСП)"
        ),
        Department(
            id = 22,
            name = "Филиал “ТБЗ “Сергеевичское”"
        ),
        Department(
            id = 23,
            name = "Филиал по производству сельскохозяйственной продукции “Бубны”"
        ),
        Department(
            id = 24,
            name = "Отдел материально-технического обеспечения, маркетинга и внешних связей (ОМТОМиВС)"
        ),
        Department(
            id = 25,
            name = "Ведомственная охрана (ВО)"
        ),
        Department(
            id = 26,
            name = "Служба обеспечения деятельности предприятия и эксплуатации зданий (СОДПиЭЗ)"
        ),
        Department(
            id = 27,
            name = "Инструктор-методист по физкультурно-оздоровительной,спортивно-массовой работе"
        ),
        Department(
            id = 28,
            name = "Культуролог"
        ),
        Department(
            id = 29,
            name = "Филиал кафедры УО “БНТУ” “Теплогазоснабжение и вентиляция”"
        ),
        Department(
            id = 30,
            name = "Здравпункт"
        ),
        Department(
            id = 31,
            name = "Центральная бухгалтерия (ЦБ)"
        ),
        Department(
            id = 32,
            name = "Отдел кадров (ОК)"
        ),
        Department(
            id = 33,
            name = "Отдел правового обеспечения (ОПО)"
        ),
        Department(
            id = 34,
            name = "Отдел делопроизводства и контроля (ОДиК)"
        ),
        Department(
            id = 35,
            name = "Режимно-секретная служба (РСС)"
        ),
        Department(
            id = 36,
            name = "Специалист по гражданской обороне"
        ),
        Department(
            id = 37,
            name = "Помощник руководителя"
        ),
        Department(
            id = 38,
            name = "Ревизор"
        )
    )
}
